susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32L55x.h
#define I2C4_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF5
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define _I2C4_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1

#define IR_OUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF1
#define _IR_OUT_PA13 (JTMS/SWDIO)_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define LPTIM1_ETR_PG12_ PG12,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1
#define _LPTIM1_ETR_PG12_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define LPTIM1_IN1_PG10_ PG10,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1
#define _LPTIM1_IN1_PG10_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define LPTIM1_IN2_PG11_ PG11,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1
#define _LPTIM1_IN2_PG11_ 1

#define LPTIM1_OUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define LPTIM1_OUT_PG15_ PG15,GPIO_AF1
#define _LPTIM1_OUT_PA14 (JTCK/SWCLK)_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1
#define _LPTIM1_OUT_PG15_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF14
#define LPTIM2_ETR_PD11_ PD11,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1
#define _LPTIM2_ETR_PD11_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF14
#define LPTIM2_IN1_PD12_ PD12,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1
#define _LPTIM2_IN1_PD12_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define LPTIM2_OUT_PD13_ PD13,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1
#define _LPTIM2_OUT_PD13_ 1

#define LPTIM3_ETR_PB14_ PB14,GPIO_AF2
#define LPTIM3_ETR_PC10_ PC10,GPIO_AF2
#define LPTIM3_ETR_PF4_ PF4,GPIO_AF2
#define _LPTIM3_ETR_PB14_ 1
#define _LPTIM3_ETR_PC10_ 1
#define _LPTIM3_ETR_PF4_ 1

#define LPTIM3_IN1_PB13_ PB13,GPIO_AF2
#define LPTIM3_IN1_PC11_ PC11,GPIO_AF2
#define LPTIM3_IN1_PF3_ PF3,GPIO_AF2
#define _LPTIM3_IN1_PB13_ 1
#define _LPTIM3_IN1_PC11_ 1
#define _LPTIM3_IN1_PF3_ 1

#define LPTIM3_OUT_PB10_ PB10,GPIO_AF2
#define LPTIM3_OUT_PC3_ PC3,GPIO_AF2
#define LPTIM3_OUT_PF5_ PF5,GPIO_AF2
#define _LPTIM3_OUT_PB10_ 1
#define _LPTIM3_OUT_PC3_ 1
#define _LPTIM3_OUT_PF5_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define LPUART1_CTS_PG5_ PG5,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PG5_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define LPUART1_DE_PG6_ PG6,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PG6_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define LPUART1_RTS_PG6_ PG6,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PG6_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define LPUART1_RX_PG8_ PG8,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PG8_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define LPUART1_TX_PG7_ PG7,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PG7_ 1

#define OCTOSPI1_CLK_PA3_ PA3,GPIO_AF10
#define OCTOSPI1_CLK_PB10_ PB10,GPIO_AF10
#define OCTOSPI1_CLK_PE10_ PE10,GPIO_AF10
#define OCTOSPI1_CLK_PF10_ PF10,GPIO_AF3
#define _OCTOSPI1_CLK_PA3_ 1
#define _OCTOSPI1_CLK_PB10_ 1
#define _OCTOSPI1_CLK_PE10_ 1
#define _OCTOSPI1_CLK_PF10_ 1

#define OCTOSPI1_DQS_PA1_ PA1,GPIO_AF10
#define OCTOSPI1_DQS_PB2_ PB2,GPIO_AF10
#define OCTOSPI1_DQS_PE3_ PE3,GPIO_AF3
#define OCTOSPI1_DQS_PG6_ PG6,GPIO_AF3
#define _OCTOSPI1_DQS_PA1_ 1
#define _OCTOSPI1_DQS_PB2_ 1
#define _OCTOSPI1_DQS_PE3_ 1
#define _OCTOSPI1_DQS_PG6_ 1

#define OCTOSPI1_IO0_PB1_ PB1,GPIO_AF10
#define OCTOSPI1_IO0_PE12_ PE12,GPIO_AF10
#define OCTOSPI1_IO0_PF8_ PF8,GPIO_AF10
#define _OCTOSPI1_IO0_PB1_ 1
#define _OCTOSPI1_IO0_PE12_ 1
#define _OCTOSPI1_IO0_PF8_ 1

#define OCTOSPI1_IO1_PB0_ PB0,GPIO_AF10
#define OCTOSPI1_IO1_PE13_ PE13,GPIO_AF10
#define OCTOSPI1_IO1_PF9_ PF9,GPIO_AF10
#define _OCTOSPI1_IO1_PB0_ 1
#define _OCTOSPI1_IO1_PE13_ 1
#define _OCTOSPI1_IO1_PF9_ 1

#define OCTOSPI1_IO2_PA7_ PA7,GPIO_AF10
#define OCTOSPI1_IO2_PE14_ PE14,GPIO_AF10
#define OCTOSPI1_IO2_PF7_ PF7,GPIO_AF10
#define _OCTOSPI1_IO2_PA7_ 1
#define _OCTOSPI1_IO2_PE14_ 1
#define _OCTOSPI1_IO2_PF7_ 1

#define OCTOSPI1_IO3_PA6_ PA6,GPIO_AF10
#define OCTOSPI1_IO3_PE15_ PE15,GPIO_AF10
#define OCTOSPI1_IO3_PF6_ PF6,GPIO_AF10
#define _OCTOSPI1_IO3_PA6_ 1
#define _OCTOSPI1_IO3_PE15_ 1
#define _OCTOSPI1_IO3_PF6_ 1

#define OCTOSPI1_IO4_PC1_ PC1,GPIO_AF10
#define OCTOSPI1_IO4_PD4_ PD4,GPIO_AF10
#define _OCTOSPI1_IO4_PC1_ 1
#define _OCTOSPI1_IO4_PD4_ 1

#define OCTOSPI1_IO5_PC2_ PC2,GPIO_AF10
#define OCTOSPI1_IO5_PD5_ PD5,GPIO_AF10
#define OCTOSPI1_IO5_PG11_ PG11,GPIO_AF3
#define _OCTOSPI1_IO5_PC2_ 1
#define _OCTOSPI1_IO5_PD5_ 1
#define _OCTOSPI1_IO5_PG11_ 1

#define OCTOSPI1_IO6_PC3_ PC3,GPIO_AF10
#define OCTOSPI1_IO6_PD6_ PD6,GPIO_AF10
#define _OCTOSPI1_IO6_PC3_ 1
#define _OCTOSPI1_IO6_PD6_ 1

#define OCTOSPI1_IO7_PC0_ PC0,GPIO_AF3
#define OCTOSPI1_IO7_PC4_ PC4,GPIO_AF10
#define OCTOSPI1_IO7_PD7_ PD7,GPIO_AF10
#define _OCTOSPI1_IO7_PC0_ 1
#define _OCTOSPI1_IO7_PC4_ 1
#define _OCTOSPI1_IO7_PD7_ 1

#define OCTOSPI1_NCLK_PB12_ PB12,GPIO_AF10
#define OCTOSPI1_NCLK_PB5_ PB5,GPIO_AF3
#define OCTOSPI1_NCLK_PE9_ PE9,GPIO_AF10
#define OCTOSPI1_NCLK_PF11_ PF11,GPIO_AF3
#define _OCTOSPI1_NCLK_PB12_ 1
#define _OCTOSPI1_NCLK_PB5_ 1
#define _OCTOSPI1_NCLK_PE9_ 1
#define _OCTOSPI1_NCLK_PF11_ 1

#define OCTOSPI1_NCS_PA2_ PA2,GPIO_AF10
#define OCTOSPI1_NCS_PA4_ PA4,GPIO_AF3
#define OCTOSPI1_NCS_PB11_ PB11,GPIO_AF10
#define OCTOSPI1_NCS_PC11_ PC11,GPIO_AF5
#define OCTOSPI1_NCS_PE11_ PE11,GPIO_AF10
#define _OCTOSPI1_NCS_PA2_ 1
#define _OCTOSPI1_NCS_PA4_ 1
#define _OCTOSPI1_NCS_PB11_ 1
#define _OCTOSPI1_NCS_PC11_ 1
#define _OCTOSPI1_NCS_PE11_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

