susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32L55x.h
#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_NSS_PA0_ PA0,GPIO_AF7
#define UART2_NSS_PD3_ PD3,GPIO_AF7
#define _UART2_NSS_PA0_ 1
#define _UART2_NSS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF3
#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA15 (JTDI)_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB0_ PB0,GPIO_AF7
#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB0_ 1
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF7
#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define UART3_DE_PB1_ PB1,GPIO_AF7
#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD12_ PD12,GPIO_AF7
#define UART3_DE_PD2_ PD2,GPIO_AF7
#define _UART3_DE_PA15 (JTDI)_ 1
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PD2_ 1

#define UART3_NSS_PA6_ PA6,GPIO_AF7
#define UART3_NSS_PB13_ PB13,GPIO_AF7
#define UART3_NSS_PD11_ PD11,GPIO_AF7
#define _UART3_NSS_PA6_ 1
#define _UART3_NSS_PB13_ 1
#define _UART3_NSS_PD11_ 1

#define UART3_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define UART3_RTS_PB1_ PB1,GPIO_AF7
#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define UART3_RTS_PD2_ PD2,GPIO_AF7
#define _UART3_RTS_PA15 (JTDI)_ 1
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PD2_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PC5_ PC5,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PC4_ PC4,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_NSS_PB7_ PB7,GPIO_AF8
#define _UART4_CTS_NSS_PB7_ 1

#define UART4_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF8
#define _UART4_DE_PA15 (JTDI)_ 1

#define UART4_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF8
#define _UART4_RTS_PA15 (JTDI)_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF8
#define UART4_RX_PC11_ PC11,GPIO_AF8
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PC11_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF8
#define UART4_TX_PC10_ PC10,GPIO_AF8
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PC10_ 1

#define UART5_CTS_NSS_PB5_ PB5,GPIO_AF8
#define _UART5_CTS_NSS_PB5_ 1

#define UART5_DE_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define _UART5_DE_PB4 (NJTRST)_ 1

#define UART5_RTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define _UART5_RTS_PB4 (NJTRST)_ 1

#define UART5_RX_PD2_ PD2,GPIO_AF8
#define _UART5_RX_PD2_ 1

#define UART5_TX_PC12_ PC12,GPIO_AF8
#define _UART5_TX_PC12_ 1

#define UART6_CTS_PA6_ PA6,GPIO_AF8
#define UART6_CTS_PB13_ PB13,GPIO_AF8
#define UART6_CTS_PG5_ PG5,GPIO_AF8
#define _UART6_CTS_PA6_ 1
#define _UART6_CTS_PB13_ 1
#define _UART6_CTS_PG5_ 1

#define UART6_DE_PB1_ PB1,GPIO_AF8
#define UART6_DE_PB12_ PB12,GPIO_AF8
#define UART6_DE_PG6_ PG6,GPIO_AF8
#define _UART6_DE_PB1_ 1
#define _UART6_DE_PB12_ 1
#define _UART6_DE_PG6_ 1

#define UART6_RTS_PB1_ PB1,GPIO_AF8
#define UART6_RTS_PB12_ PB12,GPIO_AF8
#define UART6_RTS_PG6_ PG6,GPIO_AF8
#define _UART6_RTS_PB1_ 1
#define _UART6_RTS_PB12_ 1
#define _UART6_RTS_PG6_ 1

#define UART6_RX_PA3_ PA3,GPIO_AF8
#define UART6_RX_PB10_ PB10,GPIO_AF8
#define UART6_RX_PC0_ PC0,GPIO_AF8
#define UART6_RX_PG8_ PG8,GPIO_AF8
#define _UART6_RX_PA3_ 1
#define _UART6_RX_PB10_ 1
#define _UART6_RX_PC0_ 1
#define _UART6_RX_PG8_ 1

#define UART6_TX_PA2_ PA2,GPIO_AF8
#define UART6_TX_PB11_ PB11,GPIO_AF8
#define UART6_TX_PC1_ PC1,GPIO_AF8
#define UART6_TX_PG7_ PG7,GPIO_AF8
#define _UART6_TX_PA2_ 1
#define _UART6_TX_PB11_ 1
#define _UART6_TX_PC1_ 1
#define _UART6_TX_PG7_ 1

#define UCPD1_FRSTX1_PA2_ PA2,GPIO_AF11
#define UCPD1_FRSTX1_PB2_ PB2,GPIO_AF11
#define UCPD1_FRSTX1_PG6_ PG6,GPIO_AF11
#define _UCPD1_FRSTX1_PA2_ 1
#define _UCPD1_FRSTX1_PB2_ 1
#define _UCPD1_FRSTX1_PG6_ 1

#define UCPD1_FRSTX2_PB13_ PB13,GPIO_AF11
#define UCPD1_FRSTX2_PC11_ PC11,GPIO_AF11
#define UCPD1_FRSTX2_PG7_ PG7,GPIO_AF11
#define _UCPD1_FRSTX2_PB13_ 1
#define _UCPD1_FRSTX2_PC11_ 1
#define _UCPD1_FRSTX2_PG7_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define USART1_CK_PG13_ PG13,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1
#define _USART1_CK_PG13_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define USART1_CTS_PG11_ PG11,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4 (NJTRST)_ 1
#define _USART1_CTS_PG11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define USART1_DE_PG12_ PG12,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3 (JTDO/TRACESWO)_ 1
#define _USART1_DE_PG12_ 1

#define USART1_NSS_PA11_ PA11,GPIO_AF7
#define USART1_NSS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define USART1_NSS_PG11_ PG11,GPIO_AF7
#define _USART1_NSS_PA11_ 1
#define _USART1_NSS_PB4 (NJTRST)_ 1
#define _USART1_NSS_PG11_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define USART1_RTS_PG12_ PG12,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3 (JTDO/TRACESWO)_ 1
#define _USART1_RTS_PG12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define USART1_RX_PG10_ PG10,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1
#define _USART1_RX_PG10_ 1

